export type Question = {
  id: number;
  question: string;
  options: string[];
  answer: number;
};

export const questions: Question[] = [
  // =========================================================
  // 第1週 + 第2週 MIX
  // =========================================================

  {
    id: 1,
    question: "「飛び出し注意」と書いてあります。",
    options: [
      "よびだしちゅうい",
      "とびだしちゅうい",
      "とびだしじゅうい",
      "よびだしじゅうい",
    ],
    answer: 1,
  },

  {
    id: 2,
    question: "ご協力ありがとうございます。",
    options: [
      "きゅうりょく",
      "きょうりょく",
      "こうりょく",
      "こうりゃく",
    ],
    answer: 1,
  },

  {
    id: 3,
    question: "この時計は正確です。",
    options: [
      "せいかく",
      "せっかく",
      "しょうかく",
      "しょうがく",
    ],
    answer: 0,
  },

  {
    id: 4,
    question: "日本語がわからなくて困っています。",
    options: [
      "くまって",
      "こまって",
      "よわって",
      "まいって",
    ],
    answer: 1,
  },

  {
    id: 5,
    question: "横断歩道をわたりましょう。",
    options: [
      "こうだん",
      "おうだん",
      "きんだん",
      "そうだん",
    ],
    answer: 1,
  },

  {
    id: 6,
    question: "手伝ってくれませんか。",
    options: [
      "たすけって",
      "てつだって",
      "ことづかって",
      "つたえって",
    ],
    answer: 1,
  },

  {
    id: 7,
    question: "このなべは鉄で作られています。",
    options: [
      "しつ",
      "ねつ",
      "れつ",
      "てつ",
    ],
    answer: 3,
  },

  {
    id: 8,
    question: "美術館に絵を見に行きました。",
    options: [
      "ぶじゅつかん",
      "ぎじゅつかん",
      "びじゅつかん",
      "しゅじゅつかん",
    ],
    answer: 2,
  },

  {
    id: 9,
    question: "優先席ではけいたい電話を使わないでください。",
    options: [
      "うせん",
      "にゅうせん",
      "ゆうせん",
      "よく",
    ],
    answer: 2,
  },

  {
    id: 10,
    question: "空港は空の港です。",
    options: [
      "くうこう",
      "くうきょう",
      "こうきょう",
      "こうこう",
    ],
    answer: 0,
  },

  {
    id: 11,
    question: "料金は降りるときにはらってください。",
    options: [
      "のりる",
      "ふりる",
      "こりる",
      "おりる",
    ],
    answer: 3,
  },

  {
    id: 12,
    question: "京都に金閣寺という有名なお寺があります。",
    options: [
      "じ",
      "き",
      "に",
      "ち",
    ],
    answer: 1,
  },

  {
    id: 13,
    question: "関係者以外入らないでください。",
    options: [
      "かんけいしゃ",
      "かんれんしゃ",
      "けいけんしゃ",
      "かんきょうしゃ",
    ],
    answer: 0,
  },

  {
    id: 14,
    question: "地震に備えていろいろなことをしています。",
    options: [
      "むかえて",
      "そろえて",
      "おさえて",
      "そなえて",
    ],
    answer: 3,
  },

  {
    id: 15,
    question: "確認ボタンを押します。",
    options: [
      "せきにん",
      "かくにん",
      "しょうにん",
      "こうにん",
    ],
    answer: 1,
  },

  {
    id: 16,
    question: "インフルエンザを予防する。",
    options: [
      "ゆうぼう",
      "ようぼう",
      "ゆほう",
      "よぼう",
    ],
    answer: 3,
  },

  {
    id: 17,
    question: "ドアの横にスイッチがあります。",
    options: [
      "そば",
      "よこ",
      "たて",
      "となり",
    ],
    answer: 1,
  },

  {
    id: 18,
    question: "消しゴムを貸してくれませんか。",
    options: [
      "きして",
      "けして",
      "かして",
      "さして",
    ],
    answer: 2,
  },

  {
    id: 19,
    question: "高速道路から飛行場が見えます。",
    options: [
      "こうくう",
      "ひこうば",
      "くうこう",
      "ひこうじょう",
    ],
    answer: 3,
  },

  {
    id: 20,
    question: "危ないですから、黄色い線の内側に下がってお待ちください。",
    options: [
      "うちがわ",
      "ないがわ",
      "そとがわ",
      "うしがわ",
    ],
    answer: 0,
  },

  {
    id: 21,
    question: "席はなんばんですか。",
    options: [
      "何号",
      "向番",
      "何番",
      "向号",
    ],
    answer: 2,
  },

  {
    id: 22,
    question: "友達を助けるのはあたりまえのことです。",
    options: [
      "光たり前",
      "当たり前",
      "満たり前",
      "面たり前",
    ],
    answer: 1,
  },

  {
    id: 23,
    question: "黄色いせんまで下がってお待ちください。",
    options: [
      "線",
      "信",
      "段",
      "側",
    ],
    answer: 0,
  },

  {
    id: 24,
    question: "富士山のかたちは美しい。",
    options: [
      "形",
      "骨",
      "様",
      "煙",
    ],
    answer: 0,
  },

  {
    id: 25,
    question: "あの女優はひょうげん力がある。",
    options: [
      "表信",
      "表見",
      "表言",
      "表現",
    ],
    answer: 3,
  },

  {
    id: 26,
    question: "ただ今、じゅんびちゅうです。",
    options: [
      "予約中",
      "営業中",
      "閉店中",
      "準備中",
    ],
    answer: 3,
  },

  {
    id: 27,
    question: "社長はまちがいをみとめた。",
    options: [
      "定めた",
      "認めた",
      "窓めた",
      "面めた",
    ],
    answer: 1,
  },

  {
    id: 28,
    question: "財布をひろったので、けいさつにとどけます。",
    options: [
      "交番",
      "消防",
      "警察",
      "観光",
    ],
    answer: 2,
  },

  {
    id: 29,
    question: "この電車は（　）駅に止まります。",
    options: [
      "毎",
      "次",
      "各",
      "両",
    ],
    answer: 2,
  },

  {
    id: 30,
    question: "（　）駅では禁煙となっております。",
    options: [
      "本",
      "今",
      "御",
      "当",
    ],
    answer: 3,
  },

  {
    id: 31,
    question: "あの信号は押しボタン（　）です。",
    options: [
      "箱",
      "席",
      "向",
      "式",
    ],
    answer: 3,
  },

  {
    id: 32,
    question: "この電車は（　）席、指定です。",
    options: [
      "満",
      "空",
      "全",
      "次",
    ],
    answer: 2,
  },

  {
    id: 33,
    question: "駐車場はただいま（　）車です。",
    options: [
      "両",
      "満",
      "禁",
      "非",
    ],
    answer: 1,
  },

  {
    id: 34,
    question: "交差点（　）に車を止めてはいけません。",
    options: [
      "向",
      "側",
      "線",
      "内",
    ],
    answer: 3,
  },

  {
    id: 35,
    question: "1万円以上は、送料（　）料です。",
    options: [
      "非",
      "不",
      "無",
      "禁",
    ],
    answer: 2,
  },

  {
    id: 36,
    question: "産婦人（　）の受付をする。",
    options: [
      "科",
      "化",
      "係",
      "局",
    ],
    answer: 0,
  },

  {
    id: 37,
    question: "整理（　）を取ってお待ちください。",
    options: [
      "停",
      "箱",
      "路",
      "券",
    ],
    answer: 3,
  },

  {
    id: 38,
    question: "私はA（　）に賛成です。",
    options: [
      "番",
      "券",
      "案",
      "段",
    ],
    answer: 2,
  },

  {
    id: 39,
    question: "お金は料金（　）に入れてください。",
    options: [
      "箱",
      "式",
      "側",
      "券",
    ],
    answer: 0,
  },

  {
    id: 40,
    question: "この町の人口は（　）20万人です。",
    options: [
      "各",
      "現",
      "過",
      "約",
    ],
    answer: 3,
  },
];